[{"name":"Ajaccio, Corsica","slug":"ajaccio-corsica","location":null,"content":"On the West coast of Corsica—southwest of Italy and southeast  of  France—lies  Ajaccio, the  island’s  largesttown. Replete with all the charm and sophistication one would expect of a French Mediterranean resort—palm trees,  sandy  beaches,  bountiful  shopping,  beautifulmarina and colorful cafes, bars and bistros","latitude":41.919229,"longitude":8.738635,"url":"http://localhost:3000/ports/ajaccio-corsica.json"},{"name":"Akaroa, New Zealand","slug":"akaroa-new-zealand","location":null,"content":"Nestled in the heart of an ancient volcano, Akaroa is rich  with  beautiful  bays,  French  and  English  colonialhistory, even the largest  little penguin colony on the mainland. It's also home to the rarest and smallest marine dolphin and lots of water sports-kayaking, sailboats, also hiking paths and cycle tours. Pick up a unique souvenir from one of the many local craft shopsand boutiques.","latitude":-43.8036657,"longitude":172.9682621,"url":"http://localhost:3000/ports/akaroa-new-zealand.json"},{"name":"Alaska Inside Passage","slug":"alaska-inside-passage","location":null,"content":"The incredible landscape of the Inside Passage is home to diverse wildlife - orca, mountain goats, bald eagles,bears, puffins, sea otters and more - but the superstars of the area are the gentle giants who feed here every summer. Look out for the awesome acrobatics of breaching humpback whales.","latitude":54.80068499999999,"longitude":-131.44043,"url":"http://localhost:3000/ports/alaska-inside-passage.json"},{"name":"Alesund, Norway","slug":"alesund-norway","location":null,"content":"A small fishing center in the middle of Norway's popular tourist region between Bergen and Trondheim. Although its history dates back to the Viking period, you'll notice that the architecture throughout the city has an interesting  art  nouveau  style.  This  is  because  after  amassive fire in 1904, the entire city was rebuilt. While it may have lost its historic look, you'll find it certainly didn't lose any of its charm.","latitude":62.47222840000001,"longitude":6.149482,"url":"http://localhost:3000/ports/alesund-norway.json"},{"name":"Amalfi Coast (Salerno), Italy","slug":"amalfi-coast-salerno-italy","location":null,"content":"Framed by Mount Vesuvius along a dramatic skyline, the 2,800 year-old port city of Naples is chock full of historical sites, churches, and museums that make it an incredible place for you to explore. And in the regionwhere pizza was first invented, you know the food is going to be incredible. Just 35 miles down the coast, Salerno offers you a rich history but also boasts a marvelous collection of parks, natural wonders, and unique vantage points to take in  the beauty of the Tyrrhenian  Sea.  Two  cities.  One  incredible  stretch  ofItalian coastline.","latitude":40.6333329,"longitude":14.601766,"url":"http://localhost:3000/ports/amalfi-coast-salerno-italy.json"},{"name":"Amsterdam, Holland","slug":"amsterdam-holland","location":null,"content":"Amsterdam is an eclectic mix of old and new, historical charm and cosmopolitan flair. It's a blend of cultures,but still quintessentially Dutch. The people-watching isrewarding, and the quest for rich history is even more so. Take a boat tour along the canals to enjoy the distinct and beautiful personalities of the many bridges you'll see.","latitude":52.3702157,"longitude":4.895167900000001,"url":"http://localhost:3000/ports/amsterdam-holland.json"},{"name":"Astoria, Oregon","slug":"astoria-oregon","location":null,"content":"Small-town pleasures define Astoria, which played a part in the American exploration of the West thanks to Lewis  and  Clark.  You  can  explore  nearby  Mount  St.Helens, walk the Astoria Bridge and fish for sturgeon and crab.","latitude":46.1878841,"longitude":-123.8312534,"url":"http://localhost:3000/ports/astoria-oregon.json"},{"name":"Athens (Piraeus), Greece","slug":"athens-piraeus-greece","location":null,"content":"Athens brought the world drama, history, poetry, and philosophy. Once home to the world's most powerful and civilized empires, Athens is now the world's foremostarcheological playground. The towering columns of the Parthenon still stand in homage to the virgin goddess Athena.","latitude":37.9804879,"longitude":23.6663906,"url":"http://localhost:3000/ports/athens-piraeus-greece.json"},{"name":"Auckland, New Zealand","slug":"auckland-new-zealand","location":null,"content":"Your official welcome to New Zealand comes by way of a bustling harbor. Step ashore and into a surprisingly cosmopolitan environment. And once you venture inland, even more surprises await, including a total of 48 dormant volcanoes, a lush, leafy urban cityscape filled with beautiful parks, and a number of renowned art galleries.","latitude":-36.8484597,"longitude":174.7633315,"url":"http://localhost:3000/ports/auckland-new-zealand.json"},{"name":"Baltimore, Maryland","slug":"baltimore-maryland","location":null,"content":"With a world-class aquarium, major sporting events and fantastic food, Baltimore is filled with things to do andsee. The prime spot for activity is the Inner Harbor, whereyou'll find the Harborside Shopping Pavilion, Oriole Park at Camden Yards, the National Aquarium, Port Discovery  and  much,  much  more.  Plus,  there  are  anumber of historical sites nearby, including Mount Vernon and Federal Hill.","latitude":39.2903848,"longitude":-76.6121893,"url":"http://localhost:3000/ports/baltimore-maryland.json"},{"name":"Bar Harbor, Maine","slug":"bar-harbor-maine","location":null,"content":"A wealthy summer playground during the Gilded Age, Mount  Desert  Island  welcomes  visitors  to  its  ruggedbeauty and serene parkland. The village of Bar Harboroffers    shops,    galleries,    restaurants    and    historic architecture.","latitude":44.3876119,"longitude":-68.2039123,"url":"http://localhost:3000/ports/bar-harbor-maine.json"},{"name":"Barcelona, Spain","slug":"barcelona-spain","location":null,"content":"Barcelona is located in the northeastern part of the country, 90 miles south of the French border. People from all around the world enjoy visiting this city for its individuality, cultural interest and physical beauty. The city is a major cultural center with a fascinating history.","latitude":41.297445,"longitude":2.0832941,"url":"http://localhost:3000/ports/barcelona-spain.json"},{"name":"Basseterre, St. Kitts","slug":"basseterre-st-kitts","location":null,"content":"With a town square fashioned after London's Piccadilly Circus, St. Kitts blends the gentrified feel of a European capital with island ease. For centuries, the island waswell known as one of the region's largest producers of sugarcane.","latitude":17.2995709,"longitude":-62.7311397,"url":"http://localhost:3000/ports/basseterre-st-kitts.json"},{"name":"Bay of Islands, New Zealand","slug":"bay-of-islands-new-zealand","location":null,"content":"Those who love beaches consider these some of the world’s finest, with their perfect white sand and crystal- clear water. And as tempted as you’ll be to pull up a lounge chair and soak in the surroundings, many consider this the ideal place to partake in more activepursuits, such as kayaking, mountain-biking, parasailing, swimming with dolphins and scuba-diving.","latitude":-35.1843701,"longitude":174.1646163,"url":"http://localhost:3000/ports/bay-of-islands-new-zealand.json"},{"name":"Belize City, Belize","slug":"belize-city-belize","location":null,"content":"With miles of lush tropical rain forest, a gorgeous Caribbean coastline and the longest barrier reef in the Western Hemisphere, it doesn't take long to realize whyBelize City is known as \"The JewelBelize possesses a unique combination of modernity and rustic Caribbean charm. Ancient ruins indicate that Belize was first inhabited by the Mayans in 300 B.C. This Indian heritage, combined with a rich European history, creates a destination full of charm and wonder for all to discover.","latitude":17.5045661,"longitude":-88.1962133,"url":"http://localhost:3000/ports/belize-city-belize.json"},{"name":"Bergen, Norway","slug":"bergen-norway","location":null,"content":"Bergen offers visitors a cornucopia of delights, from the sheer splendor of its rugged glacial scenery to an ancient stone church containing the finest example of Baroque art in Norway. All of it, no doubt, inspired thegreat composer Edvard Grieg, whose home and gardens are open to visitors.","latitude":60.39126279999999,"longitude":5.3220544,"url":"http://localhost:3000/ports/bergen-norway.json"},{"name":"Berlin (Warnemunde), Germany","slug":"berlin-warnemunde-germany","location":null,"content":"For so many years a city divided, Berlin is now united, bringing together cultures and languages from throughout the world. We'll access this excitingly eclectic city from Warnemünde, a charming old fishing town located at the mouth of the Warnow River.","latitude":54.166667,"longitude":12.083333,"url":"http://localhost:3000/ports/berlin-warnemunde-germany.json"},{"name":"Bombay (Mumbai), India","slug":"bombay-mumbai-india","location":null,"content":"Mumbai that encapsulates all the dynamic, chaotic parts that make up modern India. This is where you'll findeverything from succulent street food to haute cuisine, bargain-basement bazaars to the finest haute couture, humbling poverty to staggering wealth, sacred templesto hedonist nightclubs.","latitude":19.0176169,"longitude":72.8561288,"url":"http://localhost:3000/ports/bombay-mumbai-india.json"},{"name":"Boston, Massachusetts","slug":"boston-massachusetts","location":null,"content":"In the United States’ oldest city, colonial heritage is the backdrop for an inviting mix of culture and lively street life. See where Revolutionary history took place on a walking or trolley tour along Boston's Freedom Trail.","latitude":42.3600825,"longitude":-71.0588801,"url":"http://localhost:3000/ports/boston-massachusetts.json"},{"name":"Bridgetown, Barbados","slug":"bridgetown-barbados","location":null,"content":"While the surroundings and weather are unmistakably Caribbean, the ambiance is decidedly British. High tea is still served nearly everywhere, examples of Victorian architecture can be found throughout the city, cricket isa national obsession, and even the drivers observe the traditional left-side-of-the-road traffic rules.","latitude":13.1132219,"longitude":-59.59880889999999,"url":"http://localhost:3000/ports/bridgetown-barbados.json"},{"name":"Cabo San Lucas, Mexico","slug":"cabo-san-lucas-mexico","location":null,"content":"Located at the tip of the Baja Peninsula, Cabo San Lucas is a Mexican oasis known for the contrast between its deserts andbeaches. It is also well known for its deep sea fishing. Along with the neighboring town of San José del Cabo,these towns are referred to as “Los Cabos” or “the capes.” Cabo is the second largest city in the Baja Peninsula and attracts the most tourists in the area.","latitude":22.8905327,"longitude":-109.9167371,"url":"http://localhost:3000/ports/cabo-san-lucas-mexico.json"},{"name":"Cape Liberty, Bayonne, New Jersey","slug":"cape-liberty-bayonne-new-jersey","location":null,"content":"This is the first new cruise port in New Jersey in 40 years. It offers guests outstanding views of New York Harbor, the Verrazano Narrows Bridge, the Statue of Liberty and lower Manhattan.","latitude":40.6687141,"longitude":-74.1143091,"url":"http://localhost:3000/ports/cape-liberty-bayonne-new-jersey.json"},{"name":"Cartagena, Colombia","slug":"cartagena-colombia","location":null,"content":"Cobbled streets, balconies with blooming bougainvillea, and pastel plazas make Cartagena one of Latin America's most photogenic cities. But it's not just anotherpretty seaport. Founded in 1533, this Spanish-Colonial city is steeped in history. Its location made it a popular port for plunderers and pirates. Today thrill-seekers will find a perfect mix of old and new with a twist of island attitude.","latitude":10.3910485,"longitude":-75.4794257,"url":"http://localhost:3000/ports/cartagena-colombia.json"},{"name":"Castries, St. Lucia","slug":"castries-st-lucia","location":null,"content":"Owing to its somewhat checkered past, St. Lucia boasts both French and British influences. Its famous twin peaks are among the most startling geological formations in the world, while the island's easily accessible and expansive coral reefs make it a preferred destination for snorkelers.","latitude":14.0101094,"longitude":-60.98746869999999,"url":"http://localhost:3000/ports/castries-st-lucia.json"},{"name":"Catalina Island, California","slug":"catalina-island-california","location":null,"content":"A popular destination for honeymooners, they don’t call it the Island of Romance for nothing. The island is secluded and a perfect escape from the stresses  of daily life. Protected by the most stringent measures anywhere, this sanctuary is pure paradise. Boaters whomake it out here find art deco architecture, quaint boutiques, and an eclectic dining experience.","latitude":33.3878856,"longitude":-118.4163103,"url":"http://localhost:3000/ports/catalina-island-california.json"},{"name":"Catania, Sicily, Italy","slug":"catania-sicily-italy","location":null,"content":"Catania is Sicily’s second largest city, with a population of around 300,000. It lies on the Ionian Sea, under the shadow of Mount Etna, or “A Muntagna” as the locals refer to it.","latitude":37.5078772,"longitude":15.0830304,"url":"http://localhost:3000/ports/catania-sicily-italy.json"},{"name":"Chania (Souda), Crete, Greece","slug":"chania-souda-crete-greece","location":null,"content":"Like many ports in this part of the world, archeological ruins dating back to antiquity are found everywhere. There are also hundreds of gorges around the island and over 1,500 land and sea caves, including Elefantos, noted for its remarkable white and red stalactites.","latitude":35.4874818,"longitude":24.0742105,"url":"http://localhost:3000/ports/chania-souda-crete-greece.json"},{"name":"Charlotte Amalie, St. Thomas","slug":"charlotte-amalie-st-thomas","location":null,"content":"This capital port of the U.S. Virgin Islands is on the coast of a mountainous tropical paradise. Catch a great view of the Caribbean Sea from Drake's Seat or find your way to Paradise Point and their tram overlooking the harbor.","latitude":18.3419004,"longitude":-64.9307007,"url":"http://localhost:3000/ports/charlotte-amalie-st-thomas.json"},{"name":"Christchurch, New Zealand","slug":"christchurch-new-zealand","location":null,"content":"From the moment you step onshore, you'll understand why locals long ago tabbed this the \"Garden City.\" Lushgardens and parks punctuate well-spaced avenues and squares, all adorned with Victorian architecture. At the center of town is Christchurch Cathedral, a stunning example of Gothic Revival architecture.","latitude":-43.5320544,"longitude":172.6362254,"url":"http://localhost:3000/ports/christchurch-new-zealand.json"},{"name":"Cochin, India","slug":"cochin-india","location":null,"content":"One of the finest natural harbors on the Arabian coast of India, Kochi (also known as Cochin) was once knownas the center of the Indian spice trade. Subsequently,the town has a distinct European feel, due to the fact that it was once inhabited by the Portuguese, Dutch, and English. Their influence on the town's forts, palaces, museums, and old churches is still evident today. Whichis why Kochi is known as the \"Queen of the Arabian Sea.\"","latitude":9.9312328,"longitude":76.26730409999999,"url":"http://localhost:3000/ports/cochin-india.json"},{"name":"CocoCay, Bahamas","slug":"cococay-bahamas","location":"","content":"Surrounded by the gentle, translucent waters of the Bahamas chain lies the secluded island of Coco Cay®. With its white-sand beaches and spectacular surroundings, CocoCay® is a wonderland of adventure.Reserved exclusively for Royal Caribbean guests, this tropical paradise has recently been updated with newaquatic facilities, nature trails and a ton of great places to just sit back, relax and enjoy a tropical drink.","latitude":25.8178634,"longitude":-77.938883,"url":"http://localhost:3000/ports/cococay-bahamas.json"},{"name":"Colón, Panama","slug":"colon-panama","location":null,"content":"As the capital of Colón Province on Panama's central Caribbean coast, Colón lies at the very heart of thecountry's rich history and innovation. This important porttown is less than an hour's drive from Panama's most historical attractions, so it's easy to fit in visits to sites like the Panama Railroad,  Gatun Locks, and  old  Spanish fortress Fort  San  Lorenzo.  And  of  course, crystal  bluewaters and pure white sand are always a sweet setting.","latitude":9.333333,"longitude":-79.89999999999999,"url":"http://localhost:3000/ports/colon-panama.json"},{"name":"Copenhagen, Denmark","slug":"copenhagen-denmark","location":null,"content":"Whether strolling through blooming flowers in Tivoli Gardens,  witnessing  the  changing  of  the  guard  atAmalienborg Palace or touring Kronborg Castle-the setting of Shakespeare's Hamlet- it's easy to see why this once-humble fishing village grew to become the capital of Denmark.","latitude":55.6760968,"longitude":12.5683371,"url":"http://localhost:3000/ports/copenhagen-denmark.json"},{"name":"Cozumel, Mexico","slug":"cozumel-mexico","location":null,"content":"Located 12 miles east of the Yucatán Peninsula, Cozumel's coral reefs make it an underwater sanctuary for hundreds of exotic fish species, while the lush vegetation inland makes it a haven for a range of tropical bird species.","latitude":20.4229839,"longitude":-86.9223432,"url":"http://localhost:3000/ports/cozumel-mexico.json"},{"name":"Doubtful Sound, New Zealand","slug":"doubtful-sound-new-zealand","location":null,"content":"Often referred to as the \"Sound of Silence,\" Doubtful Sound is a tranquil, awe-inspiring destination known forits cascading waterfalls, looming mountains and rare marine life. While years ago only the most courageous sailors would enter the sound, today it is one of the most beautifully protected bodies of water in Fiordland National Park, attracting photographers, adventurers and cruisers from all over the globe.","latitude":-45.3260228,"longitude":166.9910671,"url":"http://localhost:3000/ports/doubtful-sound-new-zealand.json"},{"name":"Dubai, United Arab Emirates","slug":"dubai-united-arab-emirates","location":null,"content":"Believe everything you've heard about Dubai - it truly is that incredible. Honestly, where else on earth can youski both in a shopping mall and out in the desert? As oneof the world's fastest growing cities, Dubai has emerged as a premier luxury travel destination, drawing visitorsfrom  all  over  the  globe.  Its  dry  and  sunny  weather,incredible shopping experiences, and unique tourist attractions have helped to turn it into a bona fide hot spot   where   ancient   and   modern   cultures   cometogether.","latitude":25.2048493,"longitude":55.2707828,"url":"http://localhost:3000/ports/dubai-united-arab-emirates.json"},{"name":"Dunedin, New Zealand","slug":"dunedin-new-zealand","location":null,"content":"Were it not for the absence of the Scottish brogue, you might think you'd landed in Edinburgh. Both the sceneryand the architecture borrow heavily from Scotland. You can  even  shop  for  kilts  or  dig  into  a  piece  of  freshhaggis. Dunedin is also home to New Zealand's only castle, a 15-year construction endeavor complete with the only staircase of its kind in the Southern Hemisphere and magnificent woodwork.","latitude":-45.8787605,"longitude":170.5027976,"url":"http://localhost:3000/ports/dunedin-new-zealand.json"},{"name":"Dusky Sound, New Zealand","slug":"dusky-sound-new-zealand","location":null,"content":"One of the most complex fjords on New Zealand's southern  coast,  Dusky  Sound  is  a  place  of  serenebeauty, accessible today only by sea or air. Europeanexplorers first spotted this treasure when Captain Cook and his crew happened upon its opening in the late eighteenth century. Although they returned to explore its waters months later, Cook and his crew named itDusky Sound for the time of night when they first found it.","latitude":-45.7246329,"longitude":166.5065212,"url":"http://localhost:3000/ports/dusky-sound-new-zealand.json"},{"name":"Ensenada, Mexico","slug":"ensenada-mexico","location":null,"content":"The Riviera Pacifica with the Bar of the Seven Sins is located here. It boasts a colorful past - it was once the playground of California gentry and stars of the silverscreen. Festive shops, a main street and a former prison that now serves as an Aztec Museum are just some of the highlights of this Baja Peninsula favorite.","latitude":31.8667427,"longitude":-116.5963713,"url":"http://localhost:3000/ports/ensenada-mexico.json"},{"name":"Ephesus (Kusadasi), Turkey","slug":"ephesus-kusadasi-turkey","location":null,"content":"Once the capital of the Roman province of Asia Minor, this coastal town is now an archeologist's dream. Thisformer Greek banking and trading center is rich with historic sites, including the Great Theater, the Temple of Hadrian, and the Temple of Artemis, one of the Seven Wonders of the Ancient World.","latitude":37.7959865,"longitude":27.2885531,"url":"http://localhost:3000/ports/ephesus-kusadasi-turkey.json"},{"name":"Falmouth, Jamaica","slug":"falmouth-jamaica","location":null,"content":"This capital port of the U.S. Virgin Islands is on the coast of a mountainous tropical paradise. Catch a great viewof the Caribbean Sea from Drake's Seat or find your wayto Paradise Point and their tram overlooking the harbor.","latitude":18.49,"longitude":-77.661,"url":"http://localhost:3000/ports/falmouth-jamaica.json"},{"name":"Flam, Norway","slug":"flam-norway","location":null,"content":"The town of Flåm is nestled in a tributary of the world's longest and deepest fjord. Surrounded by steep mountainsides, roaring waterfalls, and deep valleys, visitors here experience a one-of-a-kind encounter with nature.","latitude":60.86116380000001,"longitude":7.115433899999999,"url":"http://localhost:3000/ports/flam-norway.json"},{"name":"Florence/Pisa (Livorno),Italy","slug":"florence-pisa-livorno-italy","location":null,"content":"The beautiful Italian seaport of Livorno is the gateway to Florence, Pisa and Tuscany’s vast wine country. Pisa is most noted for its famous marble bell tower, the Leaning Tower of Pisa, which has tilted 14 feet since 1370.","latitude":43.77147240000001,"longitude":11.1912114,"url":"http://localhost:3000/ports/florence-pisa-livorno-italy.json"},{"name":"Fort Lauderdale, Florida","slug":"fort-lauderdale-florida","location":null,"content":"This port city has been called the \"Venice of America\" due to a comprehensive canal network where you'll find gondolas docked on the Himmarshee Canal off Las Olas Boulevard.   Enjoy   extensive   strolling,   shopping,   anddining opportunities, as well as the best of sand and sun.","latitude":26.1224386,"longitude":-80.13731740000001,"url":"http://localhost:3000/ports/fort-lauderdale-florida.json"},{"name":"Fort de France, Martinique","slug":"fort-de-france-martinique","location":null,"content":"Fort de France oozes charm from its luscious hills and captivating local flavor. It's the capital of Martinique and sits at the end of a huge bay. There is a historic feel to its narrow streets, wrought-iron balconies and shuttered doors. Come and fulfill your sense of adventure, as well as your other five senses.","latitude":14.6160647,"longitude":-61.0587804,"url":"http://localhost:3000/ports/fort-de-france-martinique.json"},{"name":"Geiranger, Norway","slug":"geiranger-norway","location":null,"content":"Be sure to bring along plenty of extra film, because you'll want  to  capture  the  natural  beauty  of  Geiranger'smagnificent fjord country. Thundering waterfalls, snow- capped mountains, crystalline glaciers, and still blue lakes make this a truly unforgettable area.","latitude":62.1018025,"longitude":7.207278499999999,"url":"http://localhost:3000/ports/geiranger-norway.json"},{"name":"George Town, Grand Cayman","slug":"george-town-grand-cayman","location":null,"content":"Once a hideout for some of the most notorious pirates in history, Grand Cayman, the largest of the three Cayman Islands, is now host to visitors eager to experience snorkeling among the rays and observing sea turtles.","latitude":19.2869323,"longitude":-81.3674389,"url":"http://localhost:3000/ports/george-town-grand-cayman.json"},{"name":"Goa (Mormugao), India","slug":"goa-mormugao-india","location":null,"content":"Beguiling white sands, fresh and spicy seafood, and a cold drink under a glowing sun is Goa at its charming best. But there's plenty  more: striking Renaissance cathedrals in Old Goa, ancestral homes surrounding theragtag city  of Margao, the ornate Hindu  temples of Ponda, and Panaji's Portuguese historic district.","latitude":15.4,"longitude":73.8,"url":"http://localhost:3000/ports/goa-mormugao-india.json"},{"name":"Grand Bahama Island","slug":"grand-bahama-island","location":null,"content":"With famous white-sand beaches, fantastic shopping, two casinos and underwater adventures in the clearest water in the world, it's not surprising that Grand Bahama Island  is  the  second  most  popular  destination  in  theBahamas. Add to that the unique Bahamian  culture and all of the luxuries of a world-class destination, and you have yourself a truly amazing port of call.","latitude":26.659447,"longitude":-78.52065,"url":"http://localhost:3000/ports/grand-bahama-island.json"},{"name":"Great Stirrup Cay, Bahamas","slug":"great-stirrup-cay-bahamas","location":null,"content":"Spend a full day on expanded white sand beaches and enjoy the many activities offered. Grab a bite at thenew 8,500 square foot beach buffet which includes acentral pizza making station, two  grills, hot and cold food stations, as well as fresh fruits and breads. It’s part of NCL’s $25 million investment in island enhancements, as they create the only eco-fun private island destination in the Caribbean","latitude":25.8248705,"longitude":-77.9096036,"url":"http://localhost:3000/ports/great-stirrup-cay-bahamas.json"},{"name":"Halifax, Nova Scotia","slug":"halifax-nova-scotia","location":null,"content":"Halifax was long defined by naval operations. The 18th- century Citadel still stands guard, but today overlooks a thriving city whose restored waterfront features historicarchitecture, shops, museums, bars, restaurants and more.","latitude":44.6488625,"longitude":-63.5753196,"url":"http://localhost:3000/ports/halifax-nova-scotia.json"},{"name":"Harwich, England","slug":"harwich-england","location":null,"content":"Located just 69 miles from London, Harwich is one of England's busiest coastal towns. Here you'll discover many historic buildings, picturesque lighthouses, a quaint beach, and the Redoubt Fort, dating all the wayback to Napoleonic the era.","latitude":51.934731,"longitude":1.260297,"url":"http://localhost:3000/ports/harwich-england.json"},{"name":"Helsinki, Finland","slug":"helsinki-finland","location":null,"content":"Occupying a peninsula and several islands, this capital city's  stunning  structures  surround  some  of  the  mostspectacular bays you could ever hope to find. Stroll down broad, tree-lined streets, or take in the amazing neo-classically designed architecture in Senate Square.","latitude":60.17332440000001,"longitude":24.9410248,"url":"http://localhost:3000/ports/helsinki-finland.json"},{"name":"Hilo, Hawaii","slug":"hilo-hawaii","location":null,"content":"Located on the lush coast of the Big Island, Hilo is the capital city of Hawaii. Hilo is also where you'll find two ofthe  most  spectacular  waterfalls  in  all  of  creation:Rainbow Falls in the south and the mammoth Akaka Falls in the north, which sends hundred of thousands of gallons of water plummeting over a volcanic cliff. Hilo is also home to Volcanoes National Park and the imposingKilauea Volcano.","latitude":19.7297222,"longitude":-155.09,"url":"http://localhost:3000/ports/hilo-hawaii.json"},{"name":"Honolulu, Hawaii","slug":"honolulu-hawaii","location":null,"content":"The cosmopolitan heart of the archipelago, Honolulu rises up from the lush Hawaiian flora like a  beautiful white architectural rendering. Pearl Harbor, the Polynesian Cultural Center and lolani Palace, one of the only royal palaces on American soil, are but a few of thehundreds of attractions and points of interest available to the ambitious sightseer.","latitude":21.3069444,"longitude":-157.8583333,"url":"http://localhost:3000/ports/honolulu-hawaii.json"},{"name":"Hubbard Glacier, Alaska","slug":"hubbard-glacier-alaska","location":null,"content":"The largest tidewater glacier  on the  North American continent - moved an average of just under 5.5 feet per hour.  Hubbard Glacier is the largest calving glacier onthe North American continent. The glacier routinely calves off icebergs as high as 10-story buildings, sending massive blocks of ice into the sea every few minutes.","latitude":60.01666669999999,"longitude":-139.5,"url":"http://localhost:3000/ports/hubbard-glacier-alaska.json"},{"name":"Inside Passage, Alaska","slug":"inside-passage-alaska","location":null,"content":"Millions of years ago, southbound glaciers carved out the Inside Passage, leaving majestic fjords, islands andbays in their wake. Today, the spectacular views willleave a lasting impression on you. From the lush greenery of Tongass National Forest - the world's largest and northernmost temperate coastal rainforest - to the brilliant  blue  glaciers,  you'll  see  jaw-dropping  beautyeverywhere you look.","latitude":54.80068499999999,"longitude":-131.44043,"url":"http://localhost:3000/ports/inside-passage-alaska.json"},{"name":"International Dateline","slug":"international-dateline","location":null,"content":"This  imaginary  line  runs  roughly  parallel  to  the  180° longitudinal line. As you travel east you'll subtract  24hours from your current time, and add 24 hours as youtravel west across it.","latitude":21.1356,"longitude":-175.1947,"url":"http://localhost:3000/ports/international-dateline.json"},{"name":"Istanbul, Turkey","slug":"istanbul-turkey","location":null,"content":"In  exotic  Istanbul,  you  could  spend  an  entire  day strolling through the Grand Bazaar, exploring the famousBlue   Mosque,   or   wandering   through   the   majesticTopkapi  Palace,  with  its  gardens,  libraries  and  400- roomharem.","latitude":41.0082376,"longitude":28.9783589,"url":"http://localhost:3000/ports/istanbul-turkey.json"},{"name":"Jeju Island, South Korea","slug":"jeju-island-south-korea","location":null,"content":"South Korea's tropical island paradise will enchant you with   its   sandy   beaches,   swaying   palm   trees   andamazing volcanic landscape. Waterfalls, museums, folk villages, scuba diving, hiking and festivals galore will keep you busy. Explore the colorful coral and sea life with a scuba dive off the coast of laid-back Seogwipo. Take an underground stroll through the world’s longestlava-tube cave at Manjanggul.","latitude":33.2902148,"longitude":126.3520461,"url":"http://localhost:3000/ports/jeju-island-south-korea.json"},{"name":"Juneau, Alaska","slug":"juneau-alaska","location":null,"content":"Juneau, the capital of Alaska, was founded during a gold rush in 1880. Today, the former gold-mining towncounts among its riches some of Alaska's most spectacular scenery. Several magnificent fjords are located along the channel coast, and the majestic Mendenhall Glacier, a favorite of visitors, is nearby.","latitude":58.3019444,"longitude":-134.4197222,"url":"http://localhost:3000/ports/juneau-alaska.json"},{"name":"Kailua Kona, Hawaii","slug":"kailua-kona-hawaii","location":null,"content":"This was once the seat of power from which the great King Kamehameha ruled his island empire. Located onthe picturesque Kona Coast, Kailua Kona is close to themarine  sanctuary  of  Kealakekua  Bay.  This  snorkeling haven is also home to the Captain Cook monument.","latitude":19.639994,"longitude":-155.9969261,"url":"http://localhost:3000/ports/kailua-kona-hawaii.json"},{"name":"Ketchikan, Alaska","slug":"ketchikan-alaska","location":null,"content":"Known as the \"Salmon Capital of the World,\" Ketchikan is also the ancestral home of the Tlingit people, who havecarved the world's largest collection of totem poles. Thename comes from the Tlingit phrase \"katch kanna,\" which roughly translated means \"spread wings of a thundering eagle,\" a tribute to the hundreds of eagles that nest in the mountain forests above this small outpost.","latitude":55.34222219999999,"longitude":-131.6461111,"url":"http://localhost:3000/ports/ketchikan-alaska.json"},{"name":"Key West, Florida","slug":"key-west-florida","location":null,"content":"Key West offers a perspective on life that differs from that found anyplace else in the U.S. Home to ErnestHemingway and rumrunners, it's now the site of a ritualenjoyed by natives and visitors alike-the nightly gathering on Mallory Docks to pay homage to the most glorious sunset you may ever experience.","latitude":24.5550593,"longitude":-81.7799871,"url":"http://localhost:3000/ports/key-west-florida.json"},{"name":"Kings Wharf, Bermuda","slug":"kings-wharf-bermuda","location":null,"content":"Perched on the tip of Bermuda's West End, King's Wharf is home to an impressive Royal Navy Dockyard and acrafts market, where local artists display their wares. Nearby, Somerset Village boasts the world's smallest drawbridge,  opening  a  mere  22  inches  -  just  wideenough to accommodate a sailboat's mast..","latitude":32.3273635,"longitude":-64.8330171,"url":"http://localhost:3000/ports/kings-wharf-bermuda.json"},{"name":"Kobe, Japan","slug":"kobe-japan","location":null,"content":"Perched on a hillside overlooking the sea, Kobe is one of Japan’s most attractive and cosmopolitan cities. Homeof the heralded Kobe beef, this small city is easily navigated. Visit the Hatsukura Sake Brewery Museum for a tour or dine in one of the area’s incredible restaurants.","latitude":34.690083,"longitude":135.1955112,"url":"http://localhost:3000/ports/kobe-japan.json"},{"name":"Kralendijk, Bonaire","slug":"kralendijk-bonaire","location":null,"content":"Translated from Dutch, Kralendijk means \"coral reef,\" a tribute  to   the   expansive   and   dazzling   underwaterecosystem that surrounds the entire island, which hasbeen designated a National Marine  Park.  The name Bonaire, French for \"good air,\" hints at the prime habitat for bird watching. Keep your eyes peeled for 200 species of birds, including the pink flamingo.","latitude":12.1507,"longitude":-68.27669999999999,"url":"http://localhost:3000/ports/kralendijk-bonaire.json"},{"name":"La Coruna, Spain","slug":"la-coruna-spain","location":null,"content":"If there ever was a seafaring city, La Coruña is it. It's been a port and gateway to world travelers for over2,000 years. And from almost any spot, you can witness spectacular panoramic views of the ocean.","latitude":43.3623436,"longitude":-8.4115401,"url":"http://localhost:3000/ports/la-coruna-spain.json"},{"name":"Labadee, Haiti","slug":"labadee-haiti","location":null,"content":"On the north coast of Hispaniola, surrounded by beautiful mountain slopes and exotic foliage, sits Labadee®, Royal Caribbean's private paradise. This exclusive      destination      offers      pristine      beaches,breathtaking scenery and spectacular water activities. We even have an  amazing new Aqua Park for kids. Regardless of where you go, you'll find yourself embraced by the beautiful landscape.","latitude":19.77205,"longitude":-72.2474823,"url":"http://localhost:3000/ports/labadee-haiti.json"},{"name":"Labadee, Hispaniola","slug":"labadee-hispaniola","location":null,"content":"On the north coast of Hispaniola, surrounded by beautiful mountain slopes and exotic foliage, sits Labadee®, This exclusive destination offers pristine beaches, breathtaking scenery and spectacular wateractivities. We even have an amazing new Aqua Park for kids. Regardless of where you go, you'll find yourself embraced by the beautiful landscape.","latitude":19.77205,"longitude":-72.2474823,"url":"http://localhost:3000/ports/labadee-hispaniola.json"},{"name":"Lahaina, Maui, Hawaii","slug":"lahaina-maui-hawaii","location":null,"content":"The most prominent feature in Maui is Haleakala, the world's  largest  dormant  volcano,  rising  10,000  feetabove sea level. If you're fortunate enough to be herebetween the months of December and March, you could witness one of nature's great spectacles: the annual migration of humpback whales returning to their winter home.","latitude":20.8783333,"longitude":-156.6825,"url":"http://localhost:3000/ports/lahaina-maui-hawaii.json"},{"name":"Lanzarote, Canary Islands","slug":"lanzarote-canary-islands","location":null,"content":"With its landscapes filled with beaches and more than300 volcanoes, plus perfect weather all year round, you'll quickly see why Lanzarote is an award-winningtourist   destination.   The   island's   dedication   to   theenvironment and tourism has even resulted in recognition from the World Tourism Organization as a universal model of sustainable development.","latitude":28.0412627,"longitude":-15.5804136,"url":"http://localhost:3000/ports/lanzarote-canary-islands.json"},{"name":"Las Palmas, Gran Canaria","slug":"las-palmas-gran-canaria","location":null,"content":"Gran Canaria is one of the seven Canary Islands, located off the northwest corner of Africa. As the mostpopulated island of the archipelago, you'll find the local culture is a unique blend of Spanish, African, Latin American and Northern European communities. But the diversity doesn't end there. Gran Canaria also has three distinct   climates   and   landscapes,   including   snow-capped mountains, gorgeous beaches and tropical forests with lush vegetation.","latitude":28.1235459,"longitude":-15.4362574,"url":"http://localhost:3000/ports/las-palmas-gran-canaria.json"},{"name":"Lisbon, Portugal","slug":"lisbon-portugal","location":null,"content":"Portugal is for explorers. Its valiant seamen first charted the Azores, discovered Japan and unlocked the major sea routes the world over.  As your  ship sails into the harbor of Lisbon, share the anticipation these sailors experienced as they ventured into new and exciting lands for the first time.","latitude":38.7222524,"longitude":-9.1393366,"url":"http://localhost:3000/ports/lisbon-portugal.json"},{"name":"Los Angeles, California","slug":"los-angeles-california","location":null,"content":"Rodeo Drive, Spago, Mann's Theatre, Sunset Boulevard. There is so much to see and do in this entertainment capital, you'll have to be judicious with your time. Shopand sightsee as you keep your eyes open for Hollywood's   heroes   and   villains   in   their   off-screenpersona. L.A. has it all and then some. See the homes of the stars, or visit the Griffith Observatory and do some celestial stargazing.","latitude":34.0522342,"longitude":-118.2436849,"url":"http://localhost:3000/ports/los-angeles-california.json"},{"name":"Madeira (Funchal), Portugal","slug":"madeira-funchal-portugal","location":null,"content":"The island of Madeira is located in the Atlantic Ocean about 370 miles off the coast of Morocco. For over 100 years tourists have enjoyed its rugged volcanic peaks,beautiful tropical coastline and a climate that's never too hot or cold. Madeira lace and Madeira wine are both still produced here in the Old World tradition. Many hidden valleys, peaks and botanical gardens are just waiting to be explored.","latitude":32.6669328,"longitude":-16.9240554,"url":"http://localhost:3000/ports/madeira-funchal-portugal.json"},{"name":"Malaga, Spain","slug":"malaga-spain","location":null,"content":"A bustling coastal city and the capital of Costa del Sol, Málaga is the second largest port in Spain. One of the most interesting places to explore is the old historic quarter, which dates back nearly 800 years. The birthplace of Pablo Picasso, Málaga boasts miles of beautiful beaches, picturesque gardens and fantastic weather.","latitude":36.721261,"longitude":-4.4212655,"url":"http://localhost:3000/ports/malaga-spain.json"},{"name":"Melbourne, Australia","slug":"melbourne-australia","location":null,"content":"Europeans and Asians each have put their stamp on this amazing  city  and  turned  Melbourne  into  a  culturalmelting pot of Greek, Chinese, Italian, English and Irish,and host to major international events. From the Old World architecture and a cricket field at the center of the city, to the abundance of Australia's unusual animalsfound at the Melbourne Zoo, this city never ceases toamaze.","latitude":-37.814107,"longitude":144.96328,"url":"http://localhost:3000/ports/melbourne-australia.json"},{"name":"Miami, Florida","slug":"miami-florida","location":null,"content":"The beauty of South Beach's art deco architecture and sparkling beaches are set against a rich backdrop provided by the flavor of the Latin community. Comenightfall, Miami doesn't merely go out, it enthusiastically celebrates the onset of every evening with a passion that you'll find contagious.","latitude":25.7616798,"longitude":-80.1917902,"url":"http://localhost:3000/ports/miami-florida.json"},{"name":"Milford Sound, New Zealand","slug":"milford-sound-new-zealand","location":null,"content":"As we sail into the narrow fjords of the Milford Sound, even your massive ship seems to shrink in comparison to the towering cliffs topped by lush mountain terrain. Situated within Fiordland National Park, this natural wonder is part of the Te Wahipounamu World HeritageSite and is protected by its natural geography, which makes it a haven for all types of wildlife.","latitude":-44.671625,"longitude":167.9256213,"url":"http://localhost:3000/ports/milford-sound-new-zealand.json"},{"name":"Monterey, California","slug":"monterey-california","location":null,"content":"Beautiful Monterey Bay, that endless expanse of sparkling blue that seems to dominate the landscape. You can easily spend a day here watching divers feed fish in the kelp forest (the kelp grows four inches a day) or marveling at the beauty of the various fish and mammals.","latitude":36.6002378,"longitude":-121.8946761,"url":"http://localhost:3000/ports/monterey-california.json"},{"name":"Mount Kilauea","slug":"mount-kilauea","location":null,"content":"The Big Island has grown over 500 acres thanks to the active  nature  of  Mount  Kilauea,  Hawaii's  youngestVolcano. This molten masterpiece also happens to beone of the world's most active and likes to show off when the sun goes down. Fortunately, you'll have a front-row seat to this nighttime spectacle. Watch for the fiery lava flows that blaze down the mountainside asyour cruise ship glides by in the night. You'll never think of fireworks the same way again.","latitude":22.2119444,"longitude":-159.4122222,"url":"http://localhost:3000/ports/mount-kilauea.json"},{"name":"Muscat, Oman","slug":"muscat-oman","location":null,"content":"As one of the Middle East's oldest cities - dating back to the 2nd century AD, it's hard to believe that Muscat has been open to tourists for only a few decades. But seeing is believing! From the beautifully manicured parks and long, unspoiled stretches of beach to the stone moat that still surrounds the area, it is clear that Oman's monarchy has worked hard to protect the rich history and small, safe neighborhood feel of its capital city.","latitude":23.61,"longitude":58.54,"url":"http://localhost:3000/ports/muscat-oman.json"},{"name":"Mykonos, Greece","slug":"mykonos-greece","location":null,"content":"Mykonos is known for its whitewashed villages sprinkled with  blue  and  jade  green.  It's  also  famous  for  itssophisticated nightlife. The most popular island in theCyclades  is  bustling  with  activity,  awash  in  beautiful alleyways, and home to alluring sandy beaches.","latitude":37.4467185,"longitude":25.3288623,"url":"http://localhost:3000/ports/mykonos-greece.json"},{"name":"Naples, Italy","slug":"naples-italy","location":null,"content":"Located  on  the  southern  coast  of  Italy,  Naples  has spectacular scenery that attracts artists from around theworld. One of Naples' greatest contributions to westerncivilization-pizza- invented to honor the Queen of Italy in 1889.","latitude":40.8829943,"longitude":14.2865792,"url":"http://localhost:3000/ports/naples-italy.json"},{"name":"Nassau, Bahamas","slug":"nassau-bahamas","location":null,"content":"For a city now known for its warming sun and balmy breezes, Nassau has a tumultuous past. First settled by the English, the area was contested by England, France and Spain. For many years, Nassau was a home base for notorious pirates, and it was burned to the ground by the Spanish three different times. Since 1740, however, visitors from all over the world in search of both relaxation and adventure have made Nassau their favorite destination.","latitude":25.06,"longitude":-77.345,"url":"http://localhost:3000/ports/nassau-bahamas.json"},{"name":"New Mangalore, India","slug":"new-mangalore-india","location":null,"content":"The New Mangalore Port is located along the coast of South India and is the ninth-largest port in the country.The port is surrounded by scenic land that is dominated by coconut,  Ashoka and palm trees, rolling Sahyadri Mountains and majestic rivers that flow toward the Arabian Sea. The bustling city of Mangalore - with its richhistorical influences, narrow winding streets, quaint gable-roofed houses and intoxicating aroma of spicy coconut curries - is nearby and ready to offer its visitors a memorable cultural experience.","latitude":12.9477532,"longitude":74.82146929999999,"url":"http://localhost:3000/ports/new-mangalore-india.json"},{"name":"New York City, New York","slug":"new-york-city-new-york","location":null,"content":"Everyone loves New York and there are a million reasons why you would visit New York. Here are but a few: the Statue of Liberty, the Empire State Building, Grand Central Station, the Ellis Island National Monument, the Brooklyn Bridge, the Metropolitan Museum of Art, the Guggenheim Museum, Times Square, Broadway, Greenwich Village, 5th Avenue and Central Park.","latitude":40.7127837,"longitude":-74.0059413,"url":"http://localhost:3000/ports/new-york-city-new-york.json"},{"name":"Nice (Villefranche), France","slug":"nice-villefranche-france","location":null,"content":"This jewel of the French Riviera is home to some of the world’s most luxurious hotels and terraced cafés. Stroll the ultra-famous Promenade des Anglais or see masterpieces by Matisse, Renoir, Monet and Chagall in one of Nice’s many museums.","latitude":43.686267,"longitude":7.295276999999999,"url":"http://localhost:3000/ports/nice-villefranche-france.json"},{"name":"Ocho Rios, Jamaica","slug":"ocho-rios-jamaica","location":null,"content":"The golden beaches, swaying palm trees and fragrant air are just a prelude to what surrounds this beautiful city. Within the nearby jungle-covered mountains are the magnificent Dunn's River Falls, the foliage of FernGully and the untouched beauty of the White River.","latitude":18.4056822,"longitude":-77.0967357,"url":"http://localhost:3000/ports/ocho-rios-jamaica.json"},{"name":"Olden, Norway","slug":"olden-norway","location":null,"content":"Much of this picturesque town, located at the tip of the Nordfjord, looks as though it is straight out of the 17thcentury.  Its  many   historic   sites   include   Olden   OldChurch, built in 1759 on the site of the original stave church dating back to the 14th century, and the Singer Home, former residence of American painter William Singer.","latitude":61.8337903,"longitude":6.809329099999999,"url":"http://localhost:3000/ports/olden-norway.json"},{"name":"Oranjestad, Aruba","slug":"oranjestad-aruba","location":null,"content":"While the Dutch originally settled this island paradise, the remnants of what they brought along are flavored with the essence of the Caribbean, an intermingling that extends   to   everything   from   the   cuisine   to   thearchitecture. Don't miss the charming boutiques and tropical    gardens,    which    illustrate    this    Europeaninfluence.","latitude":12.519,"longitude":-70.03699999999999,"url":"http://localhost:3000/ports/oranjestad-aruba.json"},{"name":"Orlando and Beaches (Port Canaveral), Florida","slug":"orlando-and-beaches-port-canaveral-florida","location":null,"content":"This is the place to shuttle from one exciting port to the next. Visit nearby Kennedy Space Center for a day ofinspiring and educational exhibits. Amuse yourself at anyone of the world-class theme parks. Or spend the day watching for alligators from an airboat.","latitude":28.4103506,"longitude":-80.61881559999999,"url":"http://localhost:3000/ports/orlando-and-beaches-port-canaveral-florida.json"},{"name":"Oslo, Norway","slug":"oslo-norway","location":null,"content":"Uncovering authentic local finds and having experiences  that  make  you  feel  like  you’ve  reallyconnected  with  a  place  are  important  elements  inensuring an extraordinary vacation. We’re taking advantage of our partnership with Travel + Leisure to get their editors’ recommendations and insider tips on the places you will want to visit. Here are their picks for justone of the 150 destinations they covered.","latitude":59.9138688,"longitude":10.7522454,"url":"http://localhost:3000/ports/oslo-norway.json"},{"name":"Palma de Mallorca, Spain","slug":"palma-de-mallorca-spain","location":null,"content":"This island enclave is often described as a mini- Barcelona, with a Gothic feel that has overtaken centuries of Roman and Moorish culture. Visit El Baluard, the Museum of Modern and Contemporary Art, whichwas built on the site of the remnants of the 16th century Bastio de Sant Pere, or shop for bargain pearls at thecity's many jewelers.","latitude":39.5696005,"longitude":2.6501603,"url":"http://localhost:3000/ports/palma-de-mallorca-spain.json"},{"name":"Panama Canal (Cruising Canal)","slug":"panama-canal-cruising-canal","location":null,"content":"The canal is a marvel of engineering, but the area is also a sanctuary for sloths, eagles, ocelots and toucans, thanks to a lush rainforest environment and tropical temperatures.","latitude":8.537981,"longitude":-80.782127,"url":"http://localhost:3000/ports/panama-canal-cruising-canal.json"},{"name":"Philipsburg, St. Marteen","slug":"philipsburg-st-marteen","location":null,"content":"St. Maarten has two sides- a French and a Dutch. You can  stroll  along  the  magnificent  beaches  for  hours,browse  the  endless  French  boutiques  and  duty-freeshops, or visit sights like the cliffs and caves of Cupecoy Beach.","latitude":18.0237,"longitude":-63.04580000000001,"url":"http://localhost:3000/ports/philipsburg-st-marteen.json"},{"name":"Port Canaveral, Florida","slug":"port-canaveral-florida","location":null,"content":"The gateway to Central Florida, Port Canaveral provides access to the wonderful theme parks and entertainmentcomplexes of Orlando, the spectacular wonders of theKennedy Space Center and the natural habitats of the alligator and Florida manatee.","latitude":28.4103506,"longitude":-80.61881559999999,"url":"http://localhost:3000/ports/port-canaveral-florida.json"},{"name":"Portland, Maine","slug":"portland-maine","location":null,"content":"Portland's   heart   is   the   lively   Old   Port   of   narrow cobblestone streets and restored brick warehouses filledwith shops, restaurants, cafes and bars. The district has aworking  waterfront, too,  where  fishermen  haul  in  the day's catch.","latitude":43.66147100000001,"longitude":-70.2553259,"url":"http://localhost:3000/ports/portland-maine.json"},{"name":"Puerto Costa Maya, Mexico","slug":"puerto-costa-maya-mexico","location":null,"content":"Costa Maya, once a trading post for the Mayan Empire, is located in the Mexican Caribbean and is best knownfor its jungles, beaches, lagoons and Mayan ruins. Recent development and modern port facilities are making Costa Maya the perfect port of call. With somany activities, it will be hard to decide what to do first.","latitude":21.1382819,"longitude":-86.8918198,"url":"http://localhost:3000/ports/puerto-costa-maya-mexico.json"},{"name":"Puerto Limón, Costa Rica","slug":"puerto-limon-costa-rica","location":null,"content":"Costa   Rica   has   been   a   staunch   advocate   of conservation  in  its  undeveloped  areas  and  its  touristdestinations for years. Nature preserves throughout thecountry, particularly in Puerto Limón, allow the visitor rare exposure to virgin rain forests and bird sanctuaries.","latitude":9.983333,"longitude":-83.033333,"url":"http://localhost:3000/ports/puerto-limon-costa-rica.json"},{"name":"Puerto Quetzal, Guatemala","slug":"puerto-quetzal-guatemala","location":null,"content":"Guatemala has some of the world’s most important Mayan  ruins,  including  Iximche,  the  capital  city  ofKaqchikel Maya from 1470 until 1524. Can’t imagine getting up in the morning without your cup of joe? See how those beans are grown, harvested, and roasted at the El Barretal finca, or farm, located in the shadow of an active volcano.","latitude":13.920556,"longitude":-90.787778,"url":"http://localhost:3000/ports/puerto-quetzal-guatemala.json"},{"name":"Puerto Vallarta, Mexico","slug":"puerto-vallarta-mexico","location":null,"content":"A traditional Mexican village inhabited by genuinely warm people, Puerto Vallarta features beautiful beaches, boutique shopping and some of the most picturesque and challenging golf courses in the Western Hemisphere.","latitude":20.653407,"longitude":-105.2253316,"url":"http://localhost:3000/ports/puerto-vallarta-mexico.json"},{"name":"Puntarenas, Costa Rica","slug":"puntarenas-costa-rica","location":null,"content":"Located along the Pacific Coast of Costa Rica, Puntarenas is a great place to see native wildlife such asthe scarlet macaw and the capuchin monkey. This region's volcanic terrain and rainforest environment continue to attract travelers from around the world.","latitude":9.9778439,"longitude":-84.82942109999999,"url":"http://localhost:3000/ports/puntarenas-costa-rica.json"},{"name":"Rhodes, Greece","slug":"rhodes-greece","location":null,"content":"Rhodes,  the  friendliest  city  in  the  Mediterranean,  is situated at the island's northernmost point. This sunnyretreat is also home to many historic sites, such as theruins of the Temple of Venus and the medieval Street of Knights.","latitude":36.4349631,"longitude":28.2174829,"url":"http://localhost:3000/ports/rhodes-greece.json"},{"name":"Roatan, Honduras","slug":"roatan-honduras","location":null,"content":"Roatán Island is the largest and most developed of the three Bay Islands of Honduras and lies not far off thenorthern coast. The majority of the population of Roatánoriginated from the Cayman Islands. The growth of tourism and travel awards has put Honduras squarely on the map. Today, the beautiful Caribbean island is a mecca for divers and snorkelers. Commercial fishing isone of the main economic drivers in Roatán and is home to one of the largest fishing fleets in the Western Caribbean.","latitude":16.3239655,"longitude":-86.53501759999999,"url":"http://localhost:3000/ports/roatan-honduras.json"},{"name":"Rome (Civitavecchia), Italy","slug":"rome-civitavecchia-italy","location":null,"content":"Civitavecchia was settled in 108 A.D. by the Emperor Trajan and has since served faithfully as a gateway tothe capital of the Empire-Rome. Once the center of the Ancient World from which emperors ruled over nearly allof western civilization, Rome is still a cultural mecca. Stroll the ancient halls of the Colosseum or gaze upon the ceilings of the Sistine Chapel.","latitude":42.0924239,"longitude":11.7954132,"url":"http://localhost:3000/ports/rome-civitavecchia-italy.json"},{"name":"Roseau, Dominica","slug":"roseau-dominica","location":null,"content":"Access the largely untouched interior of Dominica via an extensive network of nature and hiking trails, which will take you on an odyssey through the lush landscapepast waterfalls, clear-running streams, and bubbling hot springs. If you'd prefer swimming to hiking, try the world- class scuba diving.","latitude":15.301389,"longitude":-61.388333,"url":"http://localhost:3000/ports/roseau-dominica.json"},{"name":"Rotterdam, Netherlands","slug":"rotterdam-netherlands","location":null,"content":"Rotterdam is one of the Netherlands’ great surprises. You won’t  find  an  abundance  of  cobblestone  streets  ormeandering waterways here. Instead, the lively city is considered a cutting-edge marvel for its modern architectural elements, chic malls and bustling harbor.","latitude":51.9244201,"longitude":4.4777325,"url":"http://localhost:3000/ports/rotterdam-netherlands.json"},{"name":"Saint John, New Brunswick (Bay of Fundy)","slug":"saint-john-new-brunswick-bay-of-fundy","location":null,"content":"Although famous for the Reversing Rapids at the Bay of Fundy, Saint  John  is  also  home  to splendid  Victorianarchitecture, quaint shops and a vibrant arts scene. It is also a gateway to New Brunswick’s scenic villages andseascapes.","latitude":45.068115,"longitude":-66.22903459999999,"url":"http://localhost:3000/ports/saint-john-new-brunswick-bay-of-fundy.json"},{"name":"Samana, Dominican Republic","slug":"samana-dominican-republic","location":null,"content":"The verdant peninsula of Samana is paradise found for nature enthusiasts. Somewhat remote and removed from the tourist trail, this patch of paradise is home to one of the most important rain forests and mangrove reserves in the Caribbean. And its crystal-clear coast features some of the best diving on the northern side of the Dominican Republic. So pop on your flippers. In some spots you can see up to 150 feet!","latitude":19.2080704,"longitude":-69.3324518,"url":"http://localhost:3000/ports/samana-dominican-republic.json"},{"name":"San Diego, California","slug":"san-diego-california","location":null,"content":"In addition  to being home to a world-class zoo and aquarium, San Diego is a laid-back navy town that is theclosest U.S. city to Mexico. Great Mexican/American cuisine, Spanish-inspired architecture and what some consider the best weather in North America, make San Diego a destination unto itself.","latitude":32.715738,"longitude":-117.1610838,"url":"http://localhost:3000/ports/san-diego-california.json"},{"name":"San Francisco, California","slug":"san-francisco-california","location":null,"content":"Today, San Francisco is one of the top tourist destinations in the world and is renowned for its cool summers, fog, steep  rolling  hills, eclectic  mix  of  architecture,  andlandmarks including the Golde Gate Bridge, cable cars, the         former prison on Alcatraz         Island,          and its Chinatown district. It  is also a primary  banking andfinance center.","latitude":37.7749295,"longitude":-122.4194155,"url":"http://localhost:3000/ports/san-francisco-california.json"},{"name":"San Juan, Puerto Rico","slug":"san-juan-puerto-rico","location":null,"content":"While San Juan is a vibrant, modern port city, it also has one foot anchored proudly in the past, dating back toits time as a Spanish colonial outpost. Many of the oldstructures, including forts and cathedrals, date back to the early 16th century and the conquest by Juan Ponce de León in 1508.","latitude":18.4663338,"longitude":-66.1057217,"url":"http://localhost:3000/ports/san-juan-puerto-rico.json"},{"name":"Santa Barbara, California","slug":"santa-barbara-california","location":null,"content":"Santa Barbara was first discovered by the Spanish in 1769,  but  they  didn’t  settle  there  right  away,  thathappened in 1782. The Spanish took over in 1782 so you can imagine that you can still see and feel the Spanish influences. Now a days most of the people who come to Santa Barbara come here to celebrate their holiday and relax at the nice beaches that Santa Barbara has to offer.","latitude":34.4208305,"longitude":-119.6981901,"url":"http://localhost:3000/ports/santa-barbara-california.json"},{"name":"Santorini, Greece","slug":"santorini-greece","location":null,"content":"Here on the island of Santorini, you'll find a classic Greek seascape-whitewashed houses accented by sea-blueroofs. This is a treasure trove for both professional and amateur archeology buffs, with sites that include tombs that date back to the 9th century and the sanctuary ofApollo.","latitude":36.3931562,"longitude":25.4615092,"url":"http://localhost:3000/ports/santorini-greece.json"},{"name":"Seattle, Washington","slug":"seattle-washington","location":null,"content":"Visitors to the Emerald City find a fusion of American, Asian and Native American cultures, set against a backdrop of Puget Sound and the Olympic Mountains. Sample  the  freshest  seafood  to  be  found  along  thePacific Rim, as well as a cup of Seattle's famous coffee.","latitude":47.6062095,"longitude":-122.3320708,"url":"http://localhost:3000/ports/seattle-washington.json"},{"name":"Seward, Alaska","slug":"seward-alaska","location":null,"content":"The land portion of your Alaska cruisetour begins or ends in Seward, a popular fishing village surrounded by theunrivaled beauty of the Kenai National Wildlife Refuge,the Alaska Maritime National Wildlife Refuge, the Chugach National Forest, and the Kenai Fjords National Park. As you might expect, opportunities for up-close- and-personal encounters with wildlife abound.","latitude":60.10416669999999,"longitude":-149.4422222,"url":"http://localhost:3000/ports/seward-alaska.json"},{"name":"Shanghai (Baoshan), China","slug":"shanghai-baoshan-china","location":null,"content":"Located at the mouth of the Yangtze River, this seaport is a vigorous modern metropolis with a rich Chinese heritage. Your trip to Shanghai is not complete without strolling the Bund, a colonial-era street with neoclassicaland art deco architecture, or visiting the Jade Buddha Temple or the beautiful Yu Gardens.","latitude":31.405457,"longitude":121.489612,"url":"http://localhost:3000/ports/shanghai-baoshan-china.json"},{"name":"Sicily (Messina), Italy","slug":"sicily-messina-italy","location":null,"content":"Located in northeastern Sicily on the slopes of the Peloritani Mountains, Messina is an ancient place with a fascinating history. Walk by the ruins of the Santa Maria Alemanna Church, built in 1220 A.D. You'll also want to see the Duomo, a Romanesque and Norman cathedralthat includes a display of artifacts in its treasury.","latitude":38.1938137,"longitude":15.5540152,"url":"http://localhost:3000/ports/sicily-messina-italy.json"},{"name":"Singapore, Asia","slug":"singapore-asia","location":null,"content":"At first glance, this diamond-shaped island just off the coast of Malaysia gleams with modernism and commercialism,  making  it  seem  more  Western  thanEastern. But as you continue to discover the city-state, you'll uncover the eclectic mix of cultures, religions, ancient treasures and British colonial impressions that give rise to a unique Singaporean identity.","latitude":1.352083,"longitude":103.819836,"url":"http://localhost:3000/ports/singapore-asia.json"},{"name":"Skagway, Alaska","slug":"skagway-alaska","location":null,"content":"When gold was discovered in the Klondike in 1896, this town was gripped by a serious epidemic of Gold Fever, one that attracted all manner of fortune hunters, saloonowners and adventurers. Now the only prospecting is done by visitors looking to take home a souvenir nugget or two.","latitude":59.45833329999999,"longitude":-135.3138889,"url":"http://localhost:3000/ports/skagway-alaska.json"},{"name":"Southhampton, England","slug":"southhampton-england","location":null,"content":"One  of  the  world's  most  famed  ports,  Southampton served as the launching point of the Mayflower and theTitanic. Today, it's one of the busiest passenger ports.","latitude":50.90970040000001,"longitude":-1.4043509,"url":"http://localhost:3000/ports/southhampton-england.json"},{"name":"St. Croix, U.S. Virgin Islands","slug":"st-croix-u-s-virgin-islands","location":null,"content":"Columbus first came to these white sand shores over 500 years  ago,  and  since  that  time  visitors  have  beendiscovering   and   rediscovering   this   island's   manypleasures.   You   can   enjoy   duty-free   shopping   in Christiansted or Frederiksted, or explore restored sugarplantations overlooking the sea.","latitude":17.7058446,"longitude":-64.858516,"url":"http://localhost:3000/ports/st-croix-u-s-virgin-islands.json"},{"name":"St. George’s, GrenadaSt. John's, Antigua","slug":"st-george-s-grenadast-john-s-antigua","location":null,"content":"The seductive breezes that gently caress this island do more than cool down Grenada's sultry nights. They carry a bouquet of fragrances-from the island's many spice plantations, its sugarcane fields, and its rum distilleries-enveloping the landscape in a distinctive perfume.What once attracted famed British seafarer Lord Horatio Nelson and the Royal Navy to these tranquil shores somany years ago now draws visitors who explore its extensive bird sanctuaries, snorkel amongst the coral reefs, and leave footprints on white sand beaches where pirates once trod.","latitude":17.0746557,"longitude":-61.8175207,"url":"http://localhost:3000/ports/st-george-s-grenadast-john-s-antigua.json"},{"name":"St. Petersburg, Russia","slug":"st-petersburg-russia","location":null,"content":"Although reportedly built to resemble such Western cities  as  London,  Paris,  and  Vienna,  one  look  at  St.Petersburg's regal palaces and vast public squares isenough to tell you that it is truly in a class of its own. If you're fortunate enough to be in St. Petersburg in June, revel  in  the  city's  famous  \"white  nights,\"  when  theboundless night sky is never completely dark.","latitude":59.9342802,"longitude":30.3350986,"url":"http://localhost:3000/ports/st-petersburg-russia.json"},{"name":"Stavanger, Norway","slug":"stavanger-norway","location":null,"content":"Whether you prefer outdoor adventure or ancient history, Stavanger offers a wide array of treasures. Aneasy day hike takes you to Lysefjord, one of the world's most beautiful overlooks, while Stavanger domkirke is the country's oldest cathedral, having been built between 1100 and 1125.","latitude":58.9699756,"longitude":5.7331073,"url":"http://localhost:3000/ports/stavanger-norway.json"},{"name":"Stockholm, Sweden","slug":"stockholm-sweden","location":null,"content":"No fewer than 50 bridges connect this Swedish capital's14   islands   to   its   mainland.   Visit   the   many   parks, museums,  and  palaces  or  make  your  way  throughGamla Stan, or Old Town, packed with historic buildings, shops, and cafés.","latitude":59.32932349999999,"longitude":18.0685808,"url":"http://localhost:3000/ports/stockholm-sweden.json"},{"name":"Sydney Australia","slug":"sydney-australia","location":null,"content":"Considered one of the most cosmopolitan cities in the Southern Hemisphere, Sydney offers just about anything-from beaches and wineries to stunning landmarks andworld-class shopping. Tour architectural marvels like the Sydney Opera House and the Sydney Harbor Bridge, view life below the surface from Sydney Aquarium's underwater walkways, or take it all in from above on atour of the Sydney Tower.","latitude":-33.8674869,"longitude":151.2069902,"url":"http://localhost:3000/ports/sydney-australia.json"},{"name":"Tallin, Estonia","slug":"tallin-estonia","location":null,"content":"Discover the influence of the old Hanseatic League in the well-preserved medieval quarter of Tallinn, with itsnarrow cobblestone alleyways. You'll find old walls, winding cobbled lanes and buildings that date back to the Middle Ages.","latitude":59.43696079999999,"longitude":24.7535746,"url":"http://localhost:3000/ports/tallin-estonia.json"},{"name":"Tampa, Florida","slug":"tampa-florida","location":null,"content":"For a  little fun, head  down  to Ybor  City, the Cuban district of Tampa, which used to be the center of production of hand-rolled cigars. Today this restored area is teeming with restaurants, shops and bars. It's also a National Historic Landmark District with amazing wrought-iron balconies, globe street lights, brick-lined walkways and the majestic architecture of the old cigar factories.","latitude":27.950575,"longitude":-82.4571776,"url":"http://localhost:3000/ports/tampa-florida.json"},{"name":"Tauranga, New Zealand","slug":"tauranga-new-zealand","location":null,"content":"Known as the Bay of Plenty, Tauranga is located at the entrance to one of the largest natural harbors in New Zealand. You can take a ride on a bush jet boat, go white-water rafting on the Rangitaiki River, or dine on the freshest fish and chips you'll ever taste, served al fresco. If you're looking for a more exotic counter, travel to the Mount Mauganui Hot Salt Water Pools.","latitude":-37.68779749999999,"longitude":176.1651295,"url":"http://localhost:3000/ports/tauranga-new-zealand.json"},{"name":"Tenerife, Canary Islands","slug":"tenerife-canary-islands","location":null,"content":"The largest of the Canary Archipelago, the island of Tenerife consists of many different regions - each with its own characteristics. There are mountains, lush valleys, agigantic crater (which is now a national park) and, of course, fabulous beaches. If the beautiful landscapesdon't bring a smile to your face, the weather certainlywill.","latitude":28.4636296,"longitude":-16.2518467,"url":"http://localhost:3000/ports/tenerife-canary-islands.json"},{"name":"Tokyo (Yokohama), Japan","slug":"tokyo-yokohama-japan","location":null,"content":"Although Tokyo is among the largest, most frenetic cities in the world, it still maintains efficiency and charm. Tokyois home to some of the world's most impressive architecture, stylish shops and four-star restaurants. In the surrounding small towns and villages, you'll discover scores of wooden residential homes, ancient temples, shrines and imperial gardens.","latitude":35.4437078,"longitude":139.6380256,"url":"http://localhost:3000/ports/tokyo-yokohama-japan.json"},{"name":"Tracy Arm Fjord, Alaska","slug":"tracy-arm-fjord-alaska","location":null,"content":"Book-ended by two of Alaska's most dramatic glaciers, the North and South Sawyer, and surrounded by granite walls that rise 3,000 feet from the emerald colored seas, this area has everything you've come to Alaska to experience.","latitude":64.2008413,"longitude":-149.4936733,"url":"http://localhost:3000/ports/tracy-arm-fjord-alaska.json"},{"name":"Valletta, Malta","slug":"valletta-malta","location":null,"content":"Explore the city's main square and pass many of its ancient buildings. Then head to St. John's Cathedral,founded by the Knights of the Order of St. John during the 16th century. Today the cathedral is the final resting place for many of the knights - their headstones line thecathedral floor.","latitude":35.8989085,"longitude":14.5145528,"url":"http://localhost:3000/ports/valletta-malta.json"},{"name":"Vancouver, British Columbia, Canada","slug":"vancouver-british-columbia-canada","location":null,"content":"The largest metropolitan center in western Canada and the country's third largest city, Vancouver is the Canadian jewel of Puget Sound. From the cobblestonestreets of the Gastown District to Little Italy and Chinatown, Vancouver offers a truly international flavor.","latitude":49.2827291,"longitude":-123.1207375,"url":"http://localhost:3000/ports/vancouver-british-columbia-canada.json"},{"name":"Venice, Italy","slug":"venice-italy","location":null,"content":"One of the world's most beautiful cities also happens to be one of its most unusual. Venice is actually spread over 120 islands in the Adriatic Sea. Because the city is connected by canals instead of streets, a good way to see Venice is on a romantic gondola ride. The epicenter of the city is St.Mark's Square, where you'll find the 900- year-old St. Mark's Basilica.","latitude":45.4408474,"longitude":12.3155151,"url":"http://localhost:3000/ports/venice-italy.json"},{"name":"Victoria, British Columbia, Canada","slug":"victoria-british-columbia-canada","location":null,"content":"The capital of British Columbia is located on Canada's largest island, Vancouver Island. This seaside enclave and one time British colony has retained much of its colonial splendor. And thanks to a temperate climate, Victoria blooms with color during the spring and summermonths.","latitude":48.4284207,"longitude":-123.3656444,"url":"http://localhost:3000/ports/victoria-british-columbia-canada.json"},{"name":"Vigo, Spain","slug":"vigo-spain","location":null,"content":"A busy, mid-sized  port on the Atlantic Coast, Vigo is located just north of Portugal and is Galacia's largestand most industrialized city, dating back to Roman times. If you're a beach-lover, then Vigo is for you. You can soak up the rays at one of several sparkling beaches, including Samil, Alcabre and Canido.","latitude":42.24059889999999,"longitude":-8.7207268,"url":"http://localhost:3000/ports/vigo-spain.json"},{"name":"Wellington, New Zealand","slug":"wellington-new-zealand","location":null,"content":"From  the  new  to  the  old,  Wellington  offers  a  bit  of everything. Locals are particularly proud of the NationalMuseum of New Zealand- Te Papa Tongarewa. Looselytranslated as \"our place\" from the native Maori tongue, the  museum  is  one  of  the  world's  largest  and  mostprogressive. A great way to explore the city is on therestored cable cars, which traverse the shopping district.","latitude":-41.2864603,"longitude":174.776236,"url":"http://localhost:3000/ports/wellington-new-zealand.json"},{"name":"Willemstad, Curacao","slug":"willemstad-curacao","location":null,"content":"Curaçao is the largest of the six islands that comprise the Netherlands  Antilles.  It  gained  autonomy  from  theNetherlands in 1954, but the Dutch influence is still very visible in Willemstad's architecture and culture. Everyone should experience the sights, sounds and energy of thisunique destination","latitude":12.116667,"longitude":-68.93333299999999,"url":"http://localhost:3000/ports/willemstad-curacao.json"}]